snlkuharlocal/src/Documents/ДопДанныеГТДкМашине/ДопДанныеГТДкМашине.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДопДанныеГТДкМашине</name>
  <basedOn>Document.Машина</basedOn>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.Машина</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеГТД</name>
    <attributes>
      <name>ГТД</name>
      <type>
        <types>CatalogRef.ГТД</types>
      </type>
    </attributes>
    <attributes>
      <name>ТНВЭД</name>
      <type>
        <types>CatalogRef.ТНВЭД</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТаможеннаяСтоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесНетто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесНеттоБезУпаковки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесБрутто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НормативУтилизации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаЭкологическогоСбора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеГТДУпаковки</name>
    <attributes>
      <name>ГТД</name>
      <type>
        <types>CatalogRef.ГТД</types>
      </type>
    </attributes>
    <attributes>
      <name>ТНВЭД</name>
      <type>
        <types>CatalogRef.ТНВЭД</types>
      </type>
    </attributes>
    <attributes>
      <name>ТНВЭДНоменклатуры</name>
      <type>
        <types>CatalogRef.ТНВЭД</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТаможеннаяСтоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесНетто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесНеттоБезУпаковки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесБрутто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НормативУтилизации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаЭкологическогоСбора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Documents/ДопДанныеГТДкМашине/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Основание <> Неопределено И ТипЗнч(Параметры.Основание) <> Тип("Массив") Тогда
		ЭтаФорма.ДокСсылка = ЗаполнениеДокументов.НайтиПодчиненныйДокумент(Параметры.Основание, "ДопДанныеГТДкМашине", Ложь, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ ЭтаФорма.ДокСсылка.Пустая() Тогда
		ОткрытьЗначение(ЭтаФорма.ДокСсылка);
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////////////

#Область ЗагрузкаИзXML

&НаКлиенте
Процедура ЗагрузитьИзXML(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл XML";
	Диалог.ПолноеИмяФайла = ""; 
	Фильтр = "Файл xml (*.xml)|*.xml"; 
	Диалог.Фильтр = Фильтр; 
	Диалог.МножественныйВыбор = Ложь;	
	Диалог.Показать(Новый ОписаниеОповещения("ЗагрузитьФайлЗавершение", ЭтаФорма, Новый Структура("Диалог", Диалог)));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьФайлЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Диалог = ДополнительныеПараметры.Диалог; 
	
	Если ВыбранныеФайлы <> Неопределено Тогда				
		
		АдресВременногоХранилища = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(Диалог.ПолноеИмяФайла));		
		ЗагрузитьИзXMLНаСервере(АдресВременногоХранилища, "xml");
				
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИзXMLНаСервере(АдресВременногоХранилища, Расширение)
	
	тзДанныеГТД = Документы.ДопДанныеГТДкМашине.ЗагрузитьИзФайлаXMLНаСервере(ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.ДопДанныеГТДкМашине")),
		АдресВременногоХранилища, Расширение);
		
	Если тзДанныеГТД.Количество() > 0 Тогда	
		Объект.ДанныеГТД.Загрузить(тзДанныеГТД);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ЗагрузкаИзЭксель

&НаКлиенте
Процедура ЗагрузитьВариант1(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл XML";
	Диалог.ПолноеИмяФайла = ""; 
	Фильтр = "Файл Эксель 2007 (*.xlsx)|*.xlsx| Файл Эксель 2003 (*.xls)|*.xls"; 
	Диалог.Фильтр = Фильтр; 
	Диалог.МножественныйВыбор = Ложь;	
	Диалог.Показать(Новый ОписаниеОповещения("ЗагрузитьФайлВариант1_Завершение", ЭтаФорма, Новый Структура("Диалог", Диалог)));

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьФайлВариант1_Завершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Диалог = ДополнительныеПараметры.Диалог;
	Индекс = Диалог.ИндексФильтра;
	
	Если Индекс = 0 Тогда
		РасширениеФайла = "xlsx";
	ИначеЕсли Индекс = 1 Тогда
		РасширениеФайла = "xls";
	КонецЕсли;
	
	Если ВыбранныеФайлы <> Неопределено Тогда				
		
		АдресВременногоХранилища = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(Диалог.ПолноеИмяФайла));		
		ЗагрузитьИзЭксельНаСервере(АдресВременногоХранилища, РасширениеФайла);
				
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИзЭксельНаСервере(АдресВременногоХранилища, Расширение)
	
	тзДанныеГТДУпаковки = Документы.ДопДанныеГТДкМашине.ЗагрузитьИзФайлаЭксельНаСервере(ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.ДопДанныеГТДкМашине")),
		АдресВременногоХранилища, Расширение);
		
	Если тзДанныеГТДУпаковки.Количество() > 0 Тогда 
		Объект.ДанныеГТДУпаковки.Загрузить(тзДанныеГТДУпаковки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

////////// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ //////////////////////////////////////////////////////////

&НаКлиенте
Процедура ДокОснованиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		
		ЭтаФорма.ДокСсылка = ЗаполнениеДокументов.НайтиПодчиненныйДокумент(ВыбранноеЗначение, "ДопДанныеГТДкМашине", Ложь, Истина);
		
		Если НЕ ЭтаФорма.ДокСсылка.Пустая() И ВыбранноеЗначение <> Объект.ДокОснование Тогда
			Объект.ДокОснование = Неопределено;
			ВызватьИсключение "Уже существует подчиненный документ к этому Основанию!!!";
		Иначе
			Объект.ДокОснование = ВыбранноеЗначение;
		КонецЕсли;
		
		ЗаполнитьНаСервере(Объект.ДокОснование);
		ЭтаФорма.ОбновитьОтображениеДанных();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеПриИзменении(Элемент)
	
	ТекДанные = Элементы.ДанныеГТД.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено Тогда
		
		ТекДанные.Всего = ТекДанные.ВесНетто * ТекДанные.НормативУтилизации * ТекДанные.СтавкаЭкологическогоСбора; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере(ДокОснование)
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.Заполнить(ДокОснование);
	ЗаполнитьЗначенияСвойств(Объект, ДокументОбъект, "Дата, Комментарий");
	ЗначениеВРеквизитФормы(ДокументОбъект.ДанныеГТД, "Объект.ДанныеГТД");
	
КонецПроцедуры
